questions = ("რა არის Python?: ",
             "რას ნიშნავს print Python-ში?: ",
             "რას აკეთებს if პირობა?: ",
             "რა არის while ციკლი?: ",
             "რას ნიშნავს HTML?: ",
             "რომელი ტეგი გამოიყენება ყველაზე დიდი სათაურისთვის?: ",
             "რას აკეთებს <br> ტეგი?: ",
             "როგორ წერენ კომენტარს HTML-ში?: ",
             "რა არის CSS?: ",
             "რას ნიშნავს JS?: ")

options = (("1.პროგრამირების ენა", "2.ვებსაიტი", "3.მონაცემთა ბაზა", "4.კომპიუტერის ოპერაციული სისტემა"),
           ("1.აღადგენს ცვლადის მნიშვნელობას", "2.ბეჭდავს მონაცემებს ეკრანზე", "3.ცვლის ცვლადის მნიშვნელობას", "4.ვერსიის პარამეტრებს უტესტავს"),
           ("1.აფასებს პირობას", "2.გამორიცხავს რაიმე შეცდომას", "3.ცვლის ცვლადს", "4.იწყებს ციკლს"),
           ("1.იწყებს ახალ ფუნქციას", "2.გამოუტანს ბოლო შედეგს", "3.აწყობს კოდის ნაწილებს", "4.იმეორებს მოქმედებებს, სანამ პირობა არ შეიცვლება"),
           ("1.პროგრამირების ენა", "2.ვებსაიტის სტრუქტურა", "3.ვებგვერდების სტილის ენა", "4.ციფრული მონაცემების ფორმატი"),
           ("1.<h1>", "2.<h6>", "3.<head>", "4.<title>"),
           ("1.აბრუნებს გვერდს უკან", "2.იწყებს სიას", "3.ამატებს ახალ ხაზს", "4.ბეჭდავს ტექსტს"),
           ("1.// კომენტარი", "2./* კომენტარი */", "3.<!-- კომენტარი -->", "4.%% კომენტარი %%"),
           ("1.მონაცემთა ბაზის მართვის სისტემა", "2.კოდირების ენა", "3.ვებგვერდების სტილის ენა", "4.პროგრამირების ენა"),
           ("1.JavaScript", "2.Java Structure", "3.Jupyter Script", "4.JSON Syntax"))

answers = ("1", "2", "1", "4", "2", "1", "3", "3", "3", "1" ) 
guesses = []
score = 0
question_num =  0

quiz = input("გამარჯობა, მოდი ვითამაშოთ სახალისო ქვიზი!(Y OR N): ")
if quiz == "N":
    print("კარგი, თუ გადაიფიქრებ მითხარი!")
    exit()
else:
    print("მოდი დავიწყოთ!") 

for question in questions:
    print("____________________")
    print(question)
    for option in options[question_num]:
      print(option)
    
    guess = input("შეიყვანე (1, 2, 3, 4): ").strip()
    guesses.append(guess)
    
    if guess == answers[question_num]:
       score += 10
       print("სწორია ✅, +10")
    else:       
        score -= 5
        print("არასწორია!❌ -5")
        print(f"სწორი პასუხია: {answers[question_num]}")

    question_num += 1
print(f"საბოლოო ქულა: {score}")